In [1]:
#conda install pytorch torchvision torchaudio pytorch-cuda=11.7 -c pytorch -c nvidia

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("Automobile_data.csv")

# 1- View Head

In [4]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

# 2- No. of rows and columns

In [5]:
df.shape

(61, 10)

# 3- Avg. price of all cars

In [6]:
df["price"].mean()

15387.0

# 4- Cheapest and Costliest car

In [7]:
df.sort_values(by=["price"],ascending=True).head(n=1) #Cheapest Car

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0

In [8]:
df.sort_values(by=["price"],ascending=False).head(n=1)  #Costliest Car

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0

# 5- How many cars have more than 100 HP?

In [12]:
count=0
for i in df["horsepower"]:
   if i>100:
     count+=1
count

29

Hence, There are 29 cars, which has horsepower more than 100.

# 6- How many hatchback cars in DataSet?

In [14]:
count=0
for i in df["body-style"]:
   if i=="hatchback":
     count+=1
count

15

Hence, There are 15 hatchback cars in dataset.

In [15]:
df["body-style"].value_counts()

sedan          32
hatchback      15
wagon           9
convertible     3
hardtop         2
Name: body-style, dtype: int64

# 7- Three most commonly found cars -

# 8- Cars, price more than 40000

In [20]:
df.loc[df["price"]>40000,["company","body-style","price"]]

          company body-style    price
11            bmw      sedan  41315.0
34  mercedes-benz      sedan  40960.0
35  mercedes-benz    hardtop  45400.0

# 9- Which are the cars that are both sedan and under 10000

In [29]:
df.loc[(df["price"]<10000) & (df["body-style"]=="sedan"),["company","body-style","price"]]

       company body-style   price
15   chevrolet      sedan  6575.0
21       isuzu      sedan  6785.0
38  mitsubishi      sedan  6989.0
39  mitsubishi      sedan  8189.0
40      nissan      sedan  7099.0
41      nissan      sedan  6649.0
42      nissan      sedan  6849.0
55  volkswagen      sedan  7775.0
56  volkswagen      sedan  7975.0
57  volkswagen      sedan  7995.0
58  volkswagen      sedan  9995.0